In [2]:
import numpy as np 
import pandas as pd 
import seaborn as sns

# 연습문제2 sol

## 1. Titanic - sns.load_dataset('titanic')

In [3]:
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived','sex','age','class','embark_town']]
titanic.tail()

     survived     sex   age   class  embark_town
886         0    male  27.0  Second  Southampton
887         1  female  19.0   First  Southampton
888         0  female   NaN   Third  Southampton
889         1    male  26.0   First    Cherbourg
890         0    male  32.0   Third   Queenstown

a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

    1)20살이 넘으면 성별을 그대로 사용한다.

    2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [4]:

titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic.tail()

     survived     sex   age   class  embark_town category1
886         0    male  27.0  Second  Southampton      male
887         1  female  19.0   First  Southampton     child
888         0  female   NaN   Third  Southampton     child
889         1    male  26.0   First    Cherbourg      male
890         0    male  32.0   Third   Queenstown      male

​
b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [12]:
titanic['age'] = titanic.age.fillna(titanic.age.mean()).astype(int)
#titanic['age'] = titanic.age.fillna(titanic.age.mean()+0.5).astype(int) # 반올림할 때
titanic.tail()

   survived     sex  age  class  embark_town category1
0         0    male   22  Third  Southampton      male
1         1  female   38  First    Cherbourg    female
2         1  female   26  Third  Southampton    female
3         1  female   35  First  Southampton    female
4         0    male   35  Third  Southampton      male

In [13]:
# a를 다시 계산, nan이었던것 재카테고리화  category1
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic.tail()

     survived     sex  age   class  embark_town category1
886         0    male   27  Second  Southampton      male
887         1  female   19   First  Southampton     child
888         0  female   29   Third  Southampton    female
889         1    male   26   First    Cherbourg      male
890         0    male   32   Third   Queenstown      male

c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [14]:
#성별 생존율
# pivot_table
titanic.pivot_table('survived', 'sex')

        survived
sex
female  0.742038
male    0.188908

In [15]:
#성별 생존율
# 위와 같은 결과 출력
# groupby
titanic[['sex','survived']].groupby(['sex']).mean()

        survived
sex
female  0.742038
male    0.188908

In [16]:
#선실별 생존율
titanic.pivot_table('survived', 'class')

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [17]:
#출발지별 생존율
titanic.pivot_table('survived', 'embark_town')

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [18]:
titanic.pivot_table('survived', ['sex','class'])

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [19]:
pd.crosstab([titanic.sex, titanic.survived], titanic['class'], margins=True)

class            First  Second  Third  All
sex    survived
female 0             3       6     72   81
       1            91      70     72  233
male   0            77      91    300  468
       1            45      17     47  109
All                216     184    491  891

d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

    bins = [1, 20, 30, 50, 70, 100]

    labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [20]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic.tail()

     survived     sex  age   class  embark_town category1 age_cat
886         0    male   27  Second  Southampton      male      청년
887         1  female   19   First  Southampton     child    미성년자
888         0  female   29   Third  Southampton    female      청년
889         1    male   26   First    Cherbourg      male      청년
890         0    male   32   Third   Queenstown      male      중년

In [21]:
#각 그룹별 생존율
titanic.pivot_table('survived', 'age_cat')

         survived
age_cat
미성년자     0.421687
청년       0.333333
중년       0.426778
장년       0.350000
노년       0.250000


e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [22]:
titanic['age_group'] = pd.qcut(titanic.age, 3, labels=["A1", "A2", "A3"])
titanic.tail()

     survived     sex  age   class  embark_town category1 age_cat age_group
886         0    male   27  Second  Southampton      male      청년        A2
887         1  female   19   First  Southampton     child    미성년자        A1
888         0  female   29   Third  Southampton    female      청년        A2
889         1    male   26   First    Cherbourg      male      청년        A2
890         0    male   32   Third   Queenstown      male      중년        A3

In [24]:
# gender: 남성이면 1, 여성이면 0
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
titanic.tail()

,survived,sex,age,class,embark_town,category1,age_cat,age_group,gender
886,0,male,27,Second,Southampton,male,청년,A2,1
887,1,female,19,First,Southampton,child,미성년자,A1,0
888,0,female,29,Third,Southampton,female,청년,A2,0
889,1,male,26,First,Cherbourg,male,청년,A2,1
890,0,male,32,Third,Queenstown,male,중년,A3,1

In [26]:
#나이 그룹별 남녀 성비와 생존율
titanic.pivot_table(['survived','gender'], 'age_group')

             gender  survived
age_group
A1         0.594684  0.411960
A2         0.680921  0.335526
A3         0.667832  0.405594

In [27]:
# 위와 같은 결과 출력
titanic[['age_group','survived','gender']].groupby(['age_group']).mean()

           survived    gender
age_group
A1         0.411960  0.594684
A2         0.335526  0.680921
A3         0.405594  0.667832

##  2. Mile Per Gallon

In [28]:
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [29]:
mpg.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

a. 배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오

In [30]:
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

b. name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

In [31]:
# 함수 정의
def get_mfcer(full_name):
    return full_name.split()[0]
def get_model(full_name):
    return ' '.join(full_name.split()[1:])

In [35]:

get_mfcer('ford torino'), get_model('ford torino')

('ford', 'torino')

In [36]:
get_mfcer('chrysler lebaron medallion'), get_model('chrysler lebaron medallion')

('chrysler', 'lebaron medallion')

In [37]:
mpg['manufacturer'] = mpg.name.apply(get_mfcer)
mpg['model'] = mpg.name.apply(get_model)
del mpg['name']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

c. 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오

In [39]:
mpg[['cylinders','mpg']].groupby('cylinders').mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [40]:
# pivot_table 사용
mpg.pivot_table('mpg','cylinders')

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

d. 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

In [41]:
mpg[['origin','hp_per_cc']].groupby('origin').mean()

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

e. 모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [42]:
mpg.manufacturer.value_counts()

ford             51
chevrolet        43
plymouth         31
amc              28
dodge            28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
mazda            10
oldsmobile       10
fiat              8
peugeot           8
audi              7
volvo             6
vw                6
chrysler          6
renault           5
opel              4
saab              4
subaru            4
chevy             3
mercedes-benz     2
maxda             2
cadillac          2
bmw               2
triumph           1
vokswagen         1
chevroelt         1
hi                1
capri             1
nissan            1
toyouta           1
mercedes          1
Name: manufacturer, dtype: int64

In [43]:
# case1)
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'amc', 'dodge', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'mazda', 'oldsmobile', 'fiat', 'peugeot', 'audi', 'volvo', 'vw', 'chrysler', 'renault']

In [44]:
# in 연산자 대신에 isin() method 사용
mpg[mpg.manufacturer.isin(big)].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

In [45]:
big_mpg = mpg[mpg.manufacturer.isin(big)]
big_mpg[['manufacturer','mpg']].groupby('manufacturer').mean()

                    mpg
manufacturer
amc           18.246429
audi          26.714286
buick         19.182353
chevrolet     20.472093
chrysler      17.266667
datsun        31.113043
dodge         22.060714
fiat          28.912500
ford          19.694118
honda         33.761538
mazda         30.860000
mercury       19.118182
oldsmobile    21.100000
peugeot       23.687500
plymouth      21.703226
pontiac       20.012500
renault       32.880000
toyota        28.372000
volkswagen    29.106667
volvo         21.116667
vw            39.016667

In [46]:
big_mpg.pivot_table('mpg','manufacturer')

                    mpg
manufacturer
amc           18.246429
audi          26.714286
buick         19.182353
chevrolet     20.472093
chrysler      17.266667
datsun        31.113043
dodge         22.060714
fiat          28.912500
ford          19.694118
honda         33.761538
mazda         30.860000
mercury       19.118182
oldsmobile    21.100000
peugeot       23.687500
plymouth      21.703226
pontiac       20.012500
renault       32.880000
toyota        28.372000
volkswagen    29.106667
volvo         21.116667
vw            39.016667

In [47]:
big_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending=False)[:5]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

In [48]:
# case2) filter이용
new_mpg = mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5)
new_mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

In [49]:
new_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending=False)[:5]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000